---
kind: property
id: P:Autodesk.Revit.DB.ViewSchedule.HasStripedRows
zh: 明细表
source: html/763633f3-f3c0-088a-b599-794cecf5e784.htm
---
# Autodesk.Revit.DB.ViewSchedule.HasStripedRows Property

**中文**: 明细表

Indicates whether this schedule has striped rows.

## Syntax (C#)
```csharp
public bool HasStripedRows { get; set; }
```

## Remarks
Striped rows can be overridden by shading or conditional formatting.